In [9]:
from sklearn.preprocessing import OneHotEncoder

In [3]:
import pandas as pd

df=pd.DataFrame({'color':['red','blue','orange','green']})

In [5]:
df.head()

    color
0     red
1    blue
2  orange
3   green

In [11]:
encoder=OneHotEncoder()

In [13]:
# sparse matrix
encoded=encoder.fit_transform(df[['color']]).toarray();

In [15]:
import pandas as pd
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [17]:
encoder_df

   color_blue  color_green  color_orange  color_red
0         0.0          0.0           0.0        1.0
1         1.0          0.0           0.0        0.0
2         0.0          0.0           1.0        0.0
3         0.0          1.0           0.0        0.0

In [19]:
pd.concat([df,encoder_df],axis=1)

    color  color_blue  color_green  color_orange  color_red
0     red         0.0          0.0           0.0        1.0
1    blue         1.0          0.0           0.0        0.0
2  orange         0.0          0.0           1.0        0.0
3   green         0.0          1.0           0.0        0.0

In [4]:
import pandas as pd

df=pd.DataFrame({'color':['red','blue','orange','green']})

In [6]:
df.head()

    color
0     red
1    blue
2  orange
3   green

### Label encoding

In [13]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder() # it is the instance

In [17]:
lbl_encoder.fit_transform(df[['color']])

D:\anaconda\Lib\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([3, 0, 2, 1])

In [19]:
lbl_encoder.transform([['red']])

D:\anaconda\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([3])

In [21]:
lbl_encoder.transform([['green']])

D:\anaconda\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([1])

In [23]:
lbl_encoder.transform([['blue']])

D:\anaconda\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

In [25]:
lbl_encoder.transform([['orange']])

D:\anaconda\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [27]:
import pandas as pd

In [31]:
from sklearn.preprocessing import OrdinalEncoder

In [33]:
df=pd.DataFrame({'size':['small','medium','large','medium','small','large']})

In [35]:
df.head()

     size
0   small
1  medium
2   large
3  medium
4   small

In [37]:
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [41]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [59]:
import pandas as pd

df=pd.DataFrame({
    'city':['india','africa','india','myanmmer','myanmmer','sri lanka'],
    'price':[200,705,342,130,549,324]
})# here price is the target variable we need to change the city to numrical based on the price of city by findign mean or median

In [61]:
df

        city  price
0      india    200
1     africa    705
2      india    342
3   myanmmer    130
4   myanmmer    549
5  sri lanka    324

In [65]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [67]:
mean_price

{'africa': 705.0, 'india': 271.0, 'myanmmer': 339.5, 'sri lanka': 324.0}

In [69]:
df['city_encoded']=df['city'].map(mean_price)

In [71]:
df.head()

       city  price  city_encoded
0     india    200         271.0
1    africa    705         705.0
2     india    342         271.0
3  myanmmer    130         339.5
4  myanmmer    549         339.5

In [75]:
df[['price','city_encoded']]

   price  city_encoded
0    200         271.0
1    705         705.0
2    342         271.0
3    130         339.5
4    549         339.5
5    324         324.0

In [81]:
import seaborn as sns
df=sns.load_dataset('tips')

In [83]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [85]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [87]:
mean_total=df.groupby('total_bill')['time'].mean().to_dict()

TypeError: category dtype does not support aggregation 'mean'

In [ ]:
mean